# FilterStringEquals Properties

---
The FilterStringEquals type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterStringRuleEvaluator)
Top
#### Reference
FilterStringEquals Class
Autodesk.Revit.DB Namespace